app/views/user_blogs/index.html.erb

SELECT "user_blogs".* FROM "user_blogs"
SELECT "blog_posts".* FROM "blog_posts" WHERE (user_blog_id = 1)
---
        <td><%=l user_blog.created_at %></td>
        <td><%= BlogPost.for_blog(user_blog.id).to_a.size %></td>