app/controllers/user_blogs_controller.rb

SELECT "user_blogs".* FROM "user_blogs"
---
  def index
    @user_blogs = UserBlog.all

INSERT INTO "user_blogs" ("title", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "цук"], ["author", "цук"], ["created_at", "2020-04-20 11:00:34.002785"], ["updated_at", "2020-04-20 11:00:34.002785"]]
---
  def create
    @user_blog = UserBlog.new(user_blog_params)

    result  = @user_blog.save! rescue false

UPDATE "user_blogs" SET "author" = $1, "title" = $2, "updated_at" = $3 WHERE "user_blogs"."id" = $4  [["author", "U2"], ["title", "New T"], ["updated_at", "2020-04-20 08:01:58.868414"], ["id", 32]]
---
  def update
    respond_to do |format|
      if @user_blog.update(user_blog_params)

DELETE FROM "user_blogs" WHERE "user_blogs"."id" = ?  [["id", 1]]
---
  def destroy
    @user_blog.destroy

SELECT "user_blogs".* FROM "user_blogs" WHERE "user_blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new_post
    @blog = UserBlog.find(params[:blog_id])

SELECT "user_blogs".* FROM "user_blogs" WHERE "user_blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "blog_posts" ("user_blog_id", "title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_blog_id", 1], ["title", "цук"], ["content", "цукуцк"], ["created_at", "2020-04-20 11:00:40.816694"], ["updated_at", "2020-04-20 11:00:40.816694"]]
---
  def create_post
    @blog = UserBlog.find_by(id: params[:blog_id])
    @blog_post = BlogPost.new(
      user_blog_id: @blog.id,
      title: params[:blog_post][:title],
      content: params[:blog_post][:content]
    )

    if @blog_post.save

SELECT "user_blogs".* FROM "user_blogs" WHERE "user_blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_user_blog
      @user_blog = UserBlog.find(params[:id])